# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# New file format for still image compression
brew "jpeg-xl"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Automation for Apps
brew "appium"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Official Amazon AWS command-line interface
brew "awscli"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Emacs dependency management
brew "cask"
# Color-highlighted diff(1) output
brew "colordiff"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Statically typed programming language for the JVM
brew "kotlin"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Port scanning utility for large networks
brew "nmap"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Open-source vector similarity search for Postgres
brew "pgvector"
# Object-relational database system
brew "postgresql@18", restart_service: :changed
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Tensors and dynamic neural networks
brew "pytorch"
# Command-line interface for qBittorrent written in Go
brew "qbittorrent-cli"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# KISS yet powerful gem/set management for curious engineers and Ruby hackers
brew "rbenv-gemset"
# Display and control your Android device
brew "scrcpy"
# Acoustic spectrum analyser
brew "spek"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Minimal, todo.txt-focused editor
brew "todo-txt"
# ASGI web server
brew "uvicorn"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Next generation frontend tooling. It's fast!
brew "vite"
# Internet file retriever
brew "wget"
# Android SDK component
cask "android-platform-tools"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# Create and run Linux containers using lightweight virtual machines
cask "container"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# Online diagram software
cask "drawio"
# GIT client
cask "fork"
# Update maps and software, sync with Garmin Connect and register your device
cask "garmin-express"
# Discover, download, and run local LLMs
cask "lm-studio"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Audiobook manager for Audible users
cask "openaudible"
# Multiplayer code editor
cask "zed"
vscode "alexkrechik.cucumberautocomplete"
vscode "cucumberopen.cucumber-official"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "itarato.byesig"
vscode "koichisasada.vscode-rdbg"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "shopify.vscode-shadowenv"
vscode "sorbet.sorbet-vscode-extension"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "zainchen.json"
go "golang.org/x/tools/gopls"
go "github.com/nats-io/natscli/nats"
go "github.com/wailsapp/wails/v2/cmd/wails"
